Once Im adding content  = "iadt" or any other value then getting bellow issue, and we cant set content_length = 4 at the time of creation: 

```
iad_t_tf_tee_object_storage kumvinov$ terraform apply -var-file="iad_t.tfvars" 
module.compartments.data.oci_identity_compartments.compartments: Refreshing state...
data.oci_objectstorage_namespace.ns: Refreshing state...
module.compartments_environment.data.oci_identity_compartments.compartments: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.objectstorage_bucket.oci_objectstorage_bucket.objectstorage_bucket["iadt-bucket-state_file-tf_tee_database"] will be created
  + resource "oci_objectstorage_bucket" "objectstorage_bucket" {
      + access_type                  = "NoPublicAccess"
      + approximate_count            = (known after apply)
      + approximate_size             = (known after apply)
      + bucket_id                    = (known after apply)
      + compartment_id               = "ocid1.compartment.oc1..aaaaaaaaxo543a"
      + created_by                   = (known after apply)
      + defined_tags                 = (known after apply)
      + etag                         = (known after apply)
      + freeform_tags                = {
          + "Environment" = "PreProduction"
          + "Purpose"     = "Terraform-Bucket-Object"
        }
      + id                           = (known after apply)
      + kms_key_id                   = (known after apply)
      + name                         = "iadt-bucket-state_file-tf_tee_database"
      + namespace                    = "axkkhcy"
      + object_events_enabled        = false
      + object_lifecycle_policy_etag = (known after apply)
      + storage_tier                 = (known after apply)
      + time_created                 = (known after apply)
    }

  # module.objectstorage_bucket.oci_objectstorage_bucket.objectstorage_bucket["iadt-bucket-state_file-tf_tee_network"] will be created
  + resource "oci_objectstorage_bucket" "objectstorage_bucket" {
      + access_type                  = "NoPublicAccess"
      + approximate_count            = (known after apply)
      + approximate_size             = (known after apply)
      + bucket_id                    = (known after apply)
      + compartment_id               = "ocid1.compartment.oc1..aaaaaaaaxovi4wr2fjrdnamicw7t5543a"
      + created_by                   = (known after apply)
      + defined_tags                 = (known after apply)
      + etag                         = (known after apply)
      + freeform_tags                = {
          + "Environment" = "PreProduction"
          + "Purpose"     = "Terraform-Bucket-Object"
        }
      + id                           = (known after apply)
      + kms_key_id                   = (known after apply)
      + name                         = "iadt-bucket-state_file-tf_tee_network"
      + namespace                    = "axkkhc"
      + object_events_enabled        = false
      + object_lifecycle_policy_etag = (known after apply)
      + storage_tier                 = (known after apply)
      + time_created                 = (known after apply)
    }

  # module.objectstorage_bucket.oci_objectstorage_bucket.objectstorage_bucket["iadt-bucket-state_file-tf_tee_otes_tools"] will be created
  + resource "oci_objectstorage_bucket" "objectstorage_bucket" {
      + access_type                  = "NoPublicAccess"
      + approximate_count            = (known after apply)
      + approximate_size             = (known after apply)
      + bucket_id                    = (known after apply)
      + compartment_id               = "ocid1.compartment.oc1..aaaaaaaaxovi543a"
      + created_by                   = (known after apply)
      + defined_tags                 = (known after apply)
      + etag                         = (known after apply)
      + freeform_tags                = {
          + "Environment" = "PreProduction"
          + "Purpose"     = "Terraform-Bucket-Object"
        }
      + id                           = (known after apply)
      + kms_key_id                   = (known after apply)
      + name                         = "iadt-bucket-state_file-tf_tee_otes_tools"
      + namespace                    = "axk"
      + object_events_enabled        = false
      + object_lifecycle_policy_etag = (known after apply)
      + storage_tier                 = (known after apply)
      + time_created                 = (known after apply)
    }

  # module.objectstorage_bucket.oci_objectstorage_bucket.objectstorage_bucket["iadt-bucket-state_file-tf_tee_storage"] will be created
  + resource "oci_objectstorage_bucket" "objectstorage_bucket" {
      + access_type                  = "NoPublicAccess"
      + approximate_count            = (known after apply)
      + approximate_size             = (known after apply)
      + bucket_id                    = (known after apply)
      + compartment_id               = "ocid1.compartment.oc1..aaaaaaaa3a"
      + created_by                   = (known after apply)
      + defined_tags                 = (known after apply)
      + etag                         = (known after apply)
      + freeform_tags                = {
          + "Environment" = "PreProduction"
          + "Purpose"     = "Terraform-Bucket-Object"
        }
      + id                           = (known after apply)
      + kms_key_id                   = (known after apply)
      + name                         = "iadt-bucket-state_file-tf_tee_storage"
      + namespace                    = "axkko"
      + object_events_enabled        = false
      + object_lifecycle_policy_etag = (known after apply)
      + storage_tier                 = (known after apply)
      + time_created                 = (known after apply)
    }

  # module.objectstorage_object.oci_objectstorage_object.objectstorage_object["iadt-object-state_file-tf_tee_database"] will be created
  + resource "oci_objectstorage_object" "objectstorage_object" {
      + bucket           = "iadt-bucket-state_file-tf_tee_database"
      + content          = "acbbf9dab37fccf489d4971ba10bad68"
      + content_language = "en-US"
      + content_length   = (known after apply)
      + content_md5      = (known after apply)
      + content_type     = "application/json"
      + id               = (known after apply)
      + namespace        = "axkkhc"
      + object           = "iadt-object-state_file-tf_tee_database.tfstate"
      + state            = (known after apply)
      + work_request_id  = (known after apply)
    }

  # module.objectstorage_object.oci_objectstorage_object.objectstorage_object["iadt-object-state_file-tf_tee_network"] will be created
  + resource "oci_objectstorage_object" "objectstorage_object" {
      + bucket           = "iadt-bucket-state_file-tf_tee_network"
      + content          = "acbbf9dab37fccf489d4971ba10bad68"
      + content_language = "en-US"
      + content_length   = (known after apply)
      + content_md5      = (known after apply)
      + content_type     = "application/json"
      + id               = (known after apply)
      + namespace        = "axo"
      + object           = "iadt-object-state_file-tf_tee_network.tfstate"
      + state            = (known after apply)
      + work_request_id  = (known after apply)
    }

  # module.objectstorage_object.oci_objectstorage_object.objectstorage_object["iadt-object-state_file-tf_tee_otes_tools"] will be created
  + resource "oci_objectstorage_object" "objectstorage_object" {
      + bucket           = "iadt-bucket-state_file-tf_tee_otes_tools"
      + content          = "acbbf9dab37fccf489d4971ba10bad68"
      + content_language = "en-US"
      + content_length   = (known after apply)
      + content_md5      = (known after apply)
      + content_type     = "application/json"
      + id               = (known after apply)
      + namespace        = "axkkhc"
      + object           = "iadt-object-state_file-tf_tee_otes_tools.tfstate"
      + state            = (known after apply)
      + work_request_id  = (known after apply)
    }

  # module.objectstorage_object.oci_objectstorage_object.objectstorage_object["iadt-object-state_file-tf_tee_storage"] will be created
  + resource "oci_objectstorage_object" "objectstorage_object" {
      + bucket           = "iadt-bucket-state_file-tf_tee_storage"
      + content          = "acbbf9dab37fccf489d4971ba10bad68"
      + content_language = "en-US"
      + content_length   = (known after apply)
      + content_md5      = (known after apply)
      + content_type     = "application/json"
      + id               = (known after apply)
      + namespace        = "auo"
      + object           = "iadt-object-state_file-tf_tee_storage.tfstate"
      + state            = (known after apply)
      + work_request_id  = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.objectstorage_object.oci_objectstorage_object.objectstorage_object["iadt-object-state_file-tf_tee_database"]: Creating...
module.objectstorage_object.oci_objectstorage_object.objectstorage_object["iadt-object-state_file-tf_tee_storage"]: Creating...
module.objectstorage_object.oci_objectstorage_object.objectstorage_object["iadt-object-state_file-tf_tee_otes_tools"]: Creating...
module.objectstorage_object.oci_objectstorage_object.objectstorage_object["iadt-object-state_file-tf_tee_network"]: Creating...
module.objectstorage_bucket.oci_objectstorage_bucket.objectstorage_bucket["iadt-bucket-state_file-tf_tee_network"]: Creating...
module.objectstorage_bucket.oci_objectstorage_bucket.objectstorage_bucket["iadt-bucket-state_file-tf_tee_otes_tools"]: Creating...
module.objectstorage_bucket.oci_objectstorage_bucket.objectstorage_bucket["iadt-bucket-state_file-tf_tee_storage"]: Creating...
module.objectstorage_bucket.oci_objectstorage_bucket.objectstorage_bucket["iadt-bucket-state_file-tf_tee_database"]: Creating...
module.objectstorage_bucket.oci_objectstorage_bucket.objectstorage_bucket["iadt-bucket-state_file-tf_tee_storage"]: Creation complete after 3s [id=n/axk/b/iadt-bucket-state_file-tf_tee_storage]
module.objectstorage_bucket.oci_objectstorage_bucket.objectstorage_bucket["iadt-bucket-state_file-tf_tee_otes_tools"]: Creation complete after 3s [id=n/axk/b/iadt-bucket-state_file-tf_tee_otes_tools]
module.objectstorage_bucket.oci_objectstorage_bucket.objectstorage_bucket["iadt-bucket-state_file-tf_tee_network"]: Creation complete after 3s [id=n/axk/b/iadt-bucket-state_file-tf_tee_network]
module.objectstorage_bucket.oci_objectstorage_bucket.objectstorage_bucket["iadt-bucket-state_file-tf_tee_database"]: Creation complete after 3s [id=n/axk/b/iadt-bucket-state_file-tf_tee_database]

Error: Put https://objectstorage.us-ashburn-1.oraclecloud.com/n/ax/b/iadt-bucket-state_file-tf_tee_storage/o/iadt-object-state_file-tf_tee_storage.tfstate: http: ContentLength=4 with Body length 0

  on .terraform/modules/objectstorage_object/object/objectstorage_object.tf line 6, in resource "oci_objectstorage_object" "objectstorage_object":
   6: resource "oci_objectstorage_object" "objectstorage_object" {



Error: Put https://objectstorage.us-ashburn-1.oraclecloud.com/n/ax/b/iadt-bucket-state_file-tf_tee_database/o/iadt-object-state_file-tf_tee_database.tfstate: http: ContentLength=4 with Body length 0

  on .terraform/modules/objectstorage_object/object/objectstorage_object.tf line 6, in resource "oci_objectstorage_object" "objectstorage_object":
   6: resource "oci_objectstorage_object" "objectstorage_object" {



Error: Put https://objectstorage.us-ashburn-1.oraclecloud.com/n/axuo/b/iadt-bucket-state_file-tf_tee_otes_tools/o/iadt-object-state_file-tf_tee_otes_tools.tfstate: http: ContentLength=4 with Body length 0

  on .terraform/modules/objectstorage_object/object/objectstorage_object.tf line 6, in resource "oci_objectstorage_object" "objectstorage_object":
   6: resource "oci_objectstorage_object" "objectstorage_object" {



Error: Put https://objectstorage.us-ashburn-1.oraclecloud.com/n/ax/b/iadt-bucket-state_file-tf_tee_network/o/iadt-object-state_file-tf_tee_network.tfstate: http: ContentLength=4 with Body length 0

  on .terraform/modules/objectstorage_object/object/objectstorage_object.tf line 6, in resource "oci_objectstorage_object" "objectstorage_object":
   6: resource "oci_objectstorage_object" "objectstorage_object" {

```